#include "stdafx.h"
#include "String.h"
#include <stdarg.h>

#include <vector>

#ifndef _WIN32

#if _MSC_VER > 1000
	#pragma warning(disable : 4996)
#endif

/*******************************************************************************
* 函数名称：	
* 功能描述：	普通构造函数
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString::CString()
{
	m_nLength = 0;
	m_nAllocLength = 1;
	m_pData = new char[m_nAllocLength];
	m_pData[m_nLength] = 0;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	拷贝构造
* 输入参数：	str	:	用于拷贝的CString变量
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString::CString(const CString &str)
{
	m_nLength = 0;
	m_nAllocLength = 0;
	m_pData = NULL;
	InputData((const char *)str, str.GetLength());
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	用字符串初始化进行构造	
* 输入参数：	lpsz	:	用于构造的字符型指针
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString::CString(const char * lpsz)
{
	m_nLength = 0;
	m_nAllocLength = 0;
	m_pData = NULL;
	InputData(lpsz, (int)strlen(lpsz));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	用特定字符串进行初始化	
* 输入参数：	pch		:	用于初始化的字符串	
*				nLength	:	拷贝的字符串的长度
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString::CString(const char *pch, int nLength)
{
	m_nLength = 0;
	m_nAllocLength = 0;
	m_pData = NULL;
	InputData(pch, nLength);
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	标准析构函数	
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString::~CString()
{
	delete []m_pData;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	输入数据
* 输入参数：	lpsz	:	源字符串指针
*				nLength	:	拷贝字符的个数
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/

void CString::InputData(const char *lpsz, int nLength)
{
	if (nLength < 0)
	{
		nLength = 0;
	}
	if (nLength + 1 > m_nAllocLength)
	{
		do 
		{
			m_nAllocLength = (0 == m_nAllocLength) ? (nLength + 1) : (m_nAllocLength * 2);
		}
		while (nLength + 1 > m_nAllocLength);

		delete []m_pData;
		m_pData = new char [m_nAllocLength];
	}
	m_nLength = nLength;
	memcpy(m_pData, lpsz, m_nLength);
	m_pData[m_nLength] = 0;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	支持转化为const char *操作
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString::operator const char *() const 
{
	return m_pData;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	赋值操作符重载
* 输入参数：	lpsz	:	值的char型指针
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString & CString::operator = (const char * lpsz) 
{
	InputData(lpsz, (int)strlen(lpsz));
	return *this;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	赋值操作符重载
* 输入参数：	值字符串
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString & CString::operator = (const CString &str) 
{
	InputData((const char *)str, str.GetLength());
	return *this;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	=判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
bool CString::operator == (const char * lpsz)
{
	return (0 == strcmp(m_pData, lpsz));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	!=判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
bool CString::operator != (const char * lpsz)
{
	return (0 != strcmp(m_pData, lpsz));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	<判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator < (const char * lpsz)
{
	return (0 > strcmp(m_pData, lpsz));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	<=判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator <= (const char * lpsz)
{
	return (0 >= strcmp(m_pData, lpsz));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	>判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator > (const char * lpsz)
{
	return (0 < strcmp(m_pData, lpsz));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	>=判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator >= (const char * lpsz)
{
	return (0 <= strcmp(m_pData, lpsz));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	==判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2011-03-07 	白福铭	      创建
*******************************************************************************/
bool CString::operator == (const CString &str)
{
	return *this == (const char *)str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	!=判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2011-03-07 	白福铭	      创建
*******************************************************************************/
bool CString::operator != (const CString &str)
{
	return *this != (const char *)str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	<判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator < (const CString &str)
{
	return *this < (const char *)str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	<=判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator <= (const CString &str)
{
	return *this <= (const char *)str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	>判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator > (const CString &str)
{
	return *this > (const char *)str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	>=判别操作符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	相等返回true, 否则返回false
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01	白福铭	      创建
*******************************************************************************/
bool CString::operator >= (const CString &str)
{
	return *this >= (const char *)str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	清空数据	
* 输入参数：	
* 输出参数：	
* 返 回 值：	执行成功返回TRUE，执行失败返回FALSE。
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
void CString::Empty()
{
	m_nLength = 0;
	m_pData[0] = 0;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	获取内部数据指针
* 输入参数：	nLength	:	获取的指针指向的内存可容纳字符的长度
* 输出参数：	
* 返 回 值：	返回数据指针
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
* 2011-03-08    司文丽        去掉对m_nLength和m_pData的修改。使之与Windows标准
*                             CString相同。           
*******************************************************************************/
char * CString::GetBuffer(int nLength)
{
	if (-1 != nLength)
	{
		if (nLength + 1 > m_nAllocLength)
		{
			m_nAllocLength = nLength + 1;
			char *pData = m_pData;
			m_pData = new char [m_nAllocLength];
			memcpy(m_pData, pData, m_nLength + 1);
			delete []pData;
		}
	}
	return m_pData;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	格式化字符串(被格式化字符串长度不能超过1024字节)
* 输入参数：	lpszFormat	:	格式化字符串
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
void CString::Format(const char * lpszFormat, ...)
{
	va_list ptr;
	std::vector<char> buf;

	va_start(ptr, lpszFormat);
	int nSize = vsnprintf(NULL, 0, lpszFormat, ptr);
	va_end(ptr);

	buf.resize(nSize + 1);
	va_start(ptr, lpszFormat);
	vsnprintf(&buf[0], buf.size(), lpszFormat, ptr);
	va_end(ptr);

	char *pBuf = &buf[0];

	InputData(pBuf, (int)strlen(pBuf));
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	字符串追加操作
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString & CString::operator += (const char * lpsz)
{
	int nNewLength = m_nLength + (int)strlen(lpsz);
	if (nNewLength + 1 > m_nAllocLength)
	{
		do 
		{
			m_nAllocLength *= 2;
		}
		while (nNewLength + 1 > m_nAllocLength);

		char *pData = m_pData;
		m_pData = new char [m_nAllocLength];
		memcpy(m_pData, pData, m_nLength + 1);
		delete []pData;
	}
	memcpy(m_pData + m_nLength, lpsz, nNewLength - m_nLength);
	m_nLength = nNewLength;
	m_pData[m_nLength] = 0;
	return *this;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	获取从某个位置开始的字符串
* 输入参数：	nFirst	:	起始获取位置
*				nCount	:	获取字符串长度
* 输出参数：	
* 返 回 值：	返回结果字符串
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString CString::Mid(int nFirst, int nCount) const
{
	if (nFirst < 0)
	{
		nFirst = 0;
	}
	if (nCount < 0)
	{
		nCount = 0;
	}
	if (nFirst >= m_nLength)
	{
		return CString();
	}
	if (nFirst + nCount > m_nLength)
	{
		nCount = m_nLength - nFirst;
	}
	return CString(m_pData + nFirst, nCount);
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	+ 运算符重载	
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2007-12-06	周锋	      创建
*******************************************************************************/
CString operator + (const char *lpsz, const CString& str)
{
	CString strRet(lpsz);
	strRet += str;
	return strRet;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	将字符串转化为大写
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2011-02-25 	白福铭	      创建
*******************************************************************************/
CString& CString::MakeUpper()
{
	for (int i = 0; i < m_nLength; ++i)
	{
		if (m_pData[i] >= 'a' && m_pData[i] <= 'z')
		{
			m_pData[i] = m_pData[i] - 'a' + 'A';
		}
	}
	return (*this);
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	将字符串转化为小写
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2011-02-25 	白福铭	      创建
*******************************************************************************/
CString& CString::MakeLower()
{
	for (int i = 0; i < m_nLength; ++i)
	{
		if (m_pData[i] >= 'A' && m_pData[i] <= 'Z')
		{
			m_pData[i] = m_pData[i] - 'A' + 'a';
		}
	}
	return (*this);
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	查找子串
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2013-07-12 	白福铭	      创建
*******************************************************************************/
int CString::Find(LPCTSTR lpszSub)
{
	char *pSub = strstr(m_pData, lpszSub);
	if (NULL == pSub)
	{
		return -1;
	}
	return pSub - m_pData;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	字符串 '==' 运算符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2011-03-03 	白福铭	      创建
*******************************************************************************/
bool operator == (const char * lpsz, const CString &str)
{
	return CString(lpsz) == str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	字符串 '!=' 运算符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2011-03-03 	白福铭	      创建
*******************************************************************************/
bool operator != (const char * lpsz, const CString &str)
{
	return CString(lpsz) != str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	字符串 '<' 运算符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01 	白福铭	      创建
*******************************************************************************/
bool operator < (const char * lpsz, const CString &str)
{
	return CString(lpsz) < str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	字符串 '<=' 运算符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01 	白福铭	      创建
*******************************************************************************/
bool operator <= (const char * lpsz, const CString &str)
{
	return CString(lpsz) <= str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	字符串 '>' 运算符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01 	白福铭	      创建
*******************************************************************************/
bool operator > (const char * lpsz, const CString &str)
{
	return CString(lpsz) > str;
}

/*******************************************************************************
* 函数名称：	
* 功能描述：	字符串 '<' 运算符重载
* 输入参数：	
* 输出参数：	
* 返 回 值：	
* 其它说明：	
* 修改日期		修改人	      修改内容
* ------------------------------------------------------------------------------
* 2012-11-01 	白福铭	      创建
*******************************************************************************/
bool operator >= (const char * lpsz, const CString &str)
{
	return CString(lpsz) >= str;
}


#endif		// end of _WIN32
